
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_1 (Conv1D)            (None, 128000, 64)        256       pip 
_________________________________________________________________
batch_normalization_1 (Batch (None, 128000, 64)        256       
_________________________________________________________________
activation_1 (Activation)    (None, 128000, 64)        0         
_________________________________________________________________
max_pooling1d_1 (MaxPooling1 (None, 32000, 64)         0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 32000, 64)         12352     
_________________________________________________________________
batch_normalization_2 (Batch (None, 32000, 64)         256       
_________________________________________________________________
activation_2 (Activation)    (None, 32000, 64)         0         
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 8000, 64)          0         
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 8000, 128)         24704     
_________________________________________________________________
batch_normalization_3 (Batch (None, 8000, 128)         512       
_________________________________________________________________
activation_3 (Activation)    (None, 8000, 128)         0         
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 2000, 128)         0         
_________________________________________________________________
conv1d_4 (Conv1D)            (None, 2000, 128)         49280     
_________________________________________________________________
batch_normalization_4 (Batch (None, 2000, 128)         512       
_________________________________________________________________
activation_4 (Activation)    (None, 2000, 128)         0         
_________________________________________________________________
max_pooling1d_4 (MaxPooling1 (None, 500, 128)          0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 500, 64)           49408     
_________________________________________________________________
seq_self_attention_1 (SeqSel (None, 500, 64)           4161      
_________________________________________________________________
lstm_2 (LSTM)                (None, 64)                33024     
_________________________________________________________________
dense_1 (Dense)              (None, 7)                 455       
=================================================================
Total params: 175,176
Trainable params: 174,408
Non-trainable params: 768   
_________________________________________________________________
